#include "stdafx.h"
#include "input.h"

extern bool isMultiline;
extern char lineinput[100];


/*********************************************************/
int GetLine(char * s)
/**********************************************************
Ввод строки в массив s. По приходу \n подпрограмма
завершается, при этом в строке s остается символ \n.
**********************************************************/
{
	int count = 0;
	char c = getchar();
	while ( c != '\n' )
	{
		s[count] = c;
		count++;
		c = getchar();
	}
	s[count] = c;
	count++;
	return count;
}


/*********************************************************/
void GetMultiLine()
/**********************************************************
Предоставляет возможность ввести многострочную строку,
разделяя строки символом \. Символы \t и \n остаются до
выполнения лексического анализа.
**********************************************************/
{
	int i = 0;
	int count;

	bool more;
	do
	{
		more = false;
		count = GetLine(lineinput+i);
		if ( lineinput[i+count-2] == '\\' )
		{
			count -= 2;
			more = true;
		}
		i += count;
		if ( more ) printf("... ");
	} while ( more );
	lineinput[i] = '\0';
}


/*********************************************************/
void string_entering()
/**********************************************************
Ввод многострочной строки. Необходимость такого ввода
определяется по предварительному синтаксическому анализу.
**********************************************************/
{
	if ( isMultiline )
	{
		printf("... ");
		isMultiline = false;
	}
	else
	{
		printf(">>> ");
	}
	GetMultiLine();
}
